# Brewfile - macOS GUI applications managed by Homebrew
# Applied via: brew bundle --file=~/.Brewfile
# Or via ansible brew_bundle role
#
# This file is managed by chezmoi. Edit the source:
#   chezmoi edit ~/.Brewfile

# =============================================================================
# Taps (Third-party repositories)
# =============================================================================
tap "homebrew/bundle"
tap "homebrew/cask"
tap "nikitabobko/tap"  # aerospace

# =============================================================================
# Formulas (CLI tools managed here instead of ansible for convenience)
# =============================================================================
brew "mas"  # Mac App Store CLI for mas entries below

# =============================================================================
# Casks - Terminals & Editors
# =============================================================================
cask "alacritty"
cask "iterm2"
cask "warp"
cask "cursor"
cask "visual-studio-code"

# =============================================================================
# Casks - AI & Coding Assistants
# =============================================================================
cask "claude"
cask "chatgpt"
# cask "chatgpt-atlas"  # Uncomment if needed
cask "ollama"

# =============================================================================
# Casks - System Utilities
# =============================================================================
cask "nikitabobko/tap/aerospace"  # Tiling window manager
cask "alt-tab"                     # Windows-style alt-tab
cask "raycast"                     # Spotlight replacement
cask "itsycal"                     # Menu bar calendar
cask "jordanbaird-ice"             # Menu bar manager (Ice.app)
cask "scroll-reverser"             # Reverse scroll direction per device
cask "sloth"                       # Process/file viewer
cask "the-unarchiver"              # Archive extraction
cask "applite"                     # GUI for Homebrew casks

# =============================================================================
# Casks - Communication
# =============================================================================
cask "discord"
cask "messenger"
cask "telegram"
cask "wechat"
cask "whatsapp"
cask "dingtalk"
cask "tencent-meeting"  # TencentMeeting.app
cask "termius"          # SSH client

# =============================================================================
# Casks - Browsers
# =============================================================================
cask "arc"
cask "google-chrome"
cask "tor-browser"

# =============================================================================
# Casks - Productivity
# =============================================================================
cask "obsidian"
cask "google-drive"
cask "grammarly-desktop"
cask "readest"              # E-book reader
cask "super-productivity"   # Task/time management
cask "wispr-flow"           # Voice typing
cask "mathpix-snipping-tool"

# =============================================================================
# Casks - Media & Entertainment
# =============================================================================
cask "spotify"
cask "anki"

# =============================================================================
# Casks - Gaming
# =============================================================================
{{ if not (env "WORK_MACHINE") -}}
cask "steam"
cask "minecraft"
cask "battle-net"
cask "hstracker"  # Hearthstone deck tracker
{{- end }}

# =============================================================================
# Casks - Finance & Trading
# =============================================================================
cask "binance"
cask "tradingview"

# =============================================================================
# Casks - Network & VPN
# =============================================================================
cask "tailscale"
cask "openvpn-connect"
cask "vibetunnel"
cask "clash-verge-rev"  # Clash proxy GUI (replacement for Clash for Windows)

# =============================================================================
# Casks - Virtualization & Remote
# =============================================================================
cask "virtualbox"
cask "windows-app"      # Microsoft Remote Desktop
cask "teamviewer-host"
cask "sharemouse"       # KVM software

# =============================================================================
# Casks - Developer Tools
# =============================================================================
# Note: docker/orbstack is managed by ansible docker role
cask "dbeaver-community"
cask "superset"

# =============================================================================
# Casks - Cloud Storage
# =============================================================================
{{ if .useChineseMirror -}}
cask "baidunetdisk"  # Baidu Netdisk (百度网盘)
{{- end }}

# =============================================================================
# Mac App Store Apps (via mas)
# Requires: brew install mas && mas signin
# =============================================================================
mas "LINE", id: 539883307
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
# mas "Magnet", id: 441258766  # Paid app - or use free 'rectangle' cask instead

# =============================================================================
# Apps NOT available via Homebrew (manual install required):
# - 东方财富, 同花顺 (Chinese finance apps)
# - FileZilla (removed from Homebrew)
# - Google Docs/Sheets/Slides (PWAs, not standalone apps)
# - Safari (system built-in)
# - osu! (use official installer)
# - Wine Staging (deprecated, use wine-stable or crossover)
# - Perplexity (App Store only)
# - Immersive Translate (browser extension)
# =============================================================================
